package com.minepalm.pickave.fear

class PickaveFear {
    //### 공포 중첩
    //
    //---
    //
    //- 맵 내에 스컬크 비명체가 1개 존재합니다.
    //- 스컬크 비명체가 활성화 되면, ‘공포’ 중첩이 1회 추가됩니다.
    //- 공포 중첩이 5회를 달성할 경우 특수 이벤트가 실행됩니다.
    //    - 모든 플레이어에게 20초간 암흑 효과가 부여됩니다.
    //    - 마지막으로 공포 중첩을 달성시킨 플레이어의 주변에 워든이 소환됩니다.
    //    - 공포 중첩이 5회를 초과할 경우, 중첩된 만큼 해당 이벤트가 실행됩니다.
    //    - 최대 공포 중첩은 10회이며 10회가 될 경우, 맵 곳곳에 워든이 소환됩니다.
    //- ‘공포’ 중첩은 모든 참여자들과 공유됩니다.
    //- 공포 중첩이 5회 이상인 상태에서 만회 나침판, 또는 특수 이벤트를 통해 4회 이하로 바뀔 경우, 모든 워든이 사라집니다.
}